Revit 2024 API
Connector.VelocityPressure Property
 The velocity pressure of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double VelocityPressure { get; }
Visual Basic
Public ReadOnly Property VelocityPressure As Double
	Get
Visual C++
public:
property double VelocityPressure {
	double get ();
}
Remarks
 Instantaneous velocity pressure of this connector,calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This connector does not support flow calculation and associated properties.
See Also
Connector Class
Autodesk.Revit.DB Namespace